idallasjlabs/agentshroud/firmware/voice-terminal/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback — auto-revert to previous slot if new firmware doesn't mark itself valid
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Octal PSRAM — required for TLS headroom + audio buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# Allocations ≤8192 bytes go to internal DRAM; larger (e.g. 16KB TLS IN buffer)
# fall through to PSRAM. Prevents mbedtls_ssl_setup OOM after WiFi+audio+AFE init.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
# Use default malloc (respects ALWAYSINTERNAL threshold) so TLS can use PSRAM.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
# Hardware MPI (RSA bignum accelerator) — ESP32-S3 has a dedicated crypto coprocessor.
# Without this, TLS RSA handshake runs in software and can starve IDLE0 for 500ms+ per
# operation. Hardware MPI reduces that to <5ms, eliminating WDT fires during reconnect.
CONFIG_MBEDTLS_HARDWARE_MPI=y
# WDT timeout increased from default 5s → 10s. DERP-relayed TLS handshakes can run
# close to 5s on slow relay paths; 10s gives headroom while HW MPI (above) takes effect.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Stack sizes — esp_timer overflow at WiFi IP acquisition with TLS in system
# ota_check has a heap-allocated 4KB buffer; main task still needs 8KB for TLS call frames
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# BOX-3 BSP board selection
CONFIG_BSP_BOARD_ESP32_S3_BOX_3=y

# CPU / power
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# BSP v3.2.0 uses i2c_new_master_bus() (driver_ng). Codec must also use new API
# to avoid the "driver_ng not allowed with old driver" conflict. Backward compat
# flag was correct for BSP v1.1.3 (old API) but breaks with BSP v3.2.0 (new API).
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# LVGL fonts — 14pt agent label (ui_face_set_agent), 20pt status, 28pt wifi splash
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# ── esp-sr / WakeNet ─────────────────────────────────────────────────────────
# Stock "Hi, ESP" keyword — no Espressif training required.
# Models land in the 9 MB 'model' SPIFFS partition (partitions.csv offset 0x6c4000).
CONFIG_USE_WAKENET=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_MODEL_IN_SPIFFS=y
# Disable MultiNet (command recognition) to save flash and PSRAM.
CONFIG_USE_MULTINET=n

# WiFi credentials (SSID pre-set; set password via: idf.py menuconfig → Voice Terminal Config)
# Voice Gateway WS URL — marvin LAN (Phase 1; switch to wss://... for Tailscale Phase 2)
CONFIG_VT_VG_WS_URL="wss://marvin.tail240ea8.ts.net/voice"

CONFIG_VT_WIFI_SSID="ford-prefect"
CONFIG_VT_WIFI_PASSWORD=""
